Table of Contents
 Class AutomationService<ClientInterface>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class AutomationService<ClientInterface> : IAutomation, IClientBIM<ClientInterface>, IDisposable
Type Parameters
ClientInterface
Inheritance
object
AutomationService<ClientInterface>
Implements
IAutomation
IClientBIM<ClientInterface>
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 AutomationService()
public AutomationService()
Properties
 BIM
public ClientInterface BIM { get; set; }
Property Value
ClientInterface
 ProjectDir
public virtual string ProjectDir { get; }
Property Value
string
 Status
public AutomationStatus Status { get; protected set; }
Property Value
AutomationStatus
 TempWorkingDir
public virtual string TempWorkingDir { get; }
Property Value
string
Methods
 CloseProject()
Close the
public virtual void CloseProject()
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool disposing)
Parameters
disposing bool
 NotifyChange()
public virtual void NotifyChange()
 OpenProject(string)
Open fileName
public virtual void OpenProject(string fileName)
Parameters
fileName string
Project to open
 Refresh()
public virtual void Refresh()
 RefreshProject()
Refresh the currently open project
public virtual void RefreshProject()
 SelectItem(string)
Select item with itemId in the project
public virtual void SelectItem(string itemId)
Parameters
itemId string
The identifier of the requested item
 Shutdown()
public virtual void Shutdown()
 Edit this page